user/tutorials/pf_test_case_TML/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          640;
        startFace       639;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          640;
        startFace       1279;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          640;
        startFace       1919;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          640;
        startFace       2559;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            patch;
        nFaces          1;
        startFace       3199;
    }
    top
    {
        type            patch;
        nFaces          1;
        startFace       3200;
    }
)

// ************************************************************************* //
